VinFan0/QuickDrehm/QuickDrehm/arduino/boards.txt
##############################################################

nano328old.name=Arduino Nano w/ ATmega328 (Old bootloader)

nano328old.upload.protocol=arduino
nano328old.upload.maximum_size=30720
nano328old.upload.speed=57600
nano328old.upload.uart_mode=1

nano328old.bootloader.low_fuses=0xFF
nano328old.bootloader.high_fuses=0xDA
nano328old.bootloader.extended_fuses=0x05
nano328old.bootloader.path=atmega
nano328old.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328old.bootloader.unlock_bits=0x3F
nano328old.bootloader.lock_bits=0x0F

nano328old.build.mcu=atmega328p
nano328old.build.f_cpu=16000000L
nano328old.build.board=AVR_NANO
nano328old.build.core=arduino
nano328old.build.variant=eightanaloginputs

##############################################################

nano328_340.name=Arduino Nano w/ ATmega328/CH340G

nano328_340.upload.protocol=arduino
nano328_340.upload.maximum_size=30720
nano328_340.upload.speed=115200
nano328_340.upload.uart_mode=3

nano328_340.bootloader.low_fuses=0xFF
nano328_340.bootloader.high_fuses=0xDA
nano328_340.bootloader.extended_fuses=0x05
nano328_340.bootloader.path=atmega
nano328_340.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328_340.bootloader.unlock_bits=0x3F
nano328_340.bootloader.lock_bits=0x0F

nano328_340.build.mcu=atmega328p
nano328_340.build.f_cpu=16000000L
nano328_340.build.board=AVR_NANO
nano328_340.build.core=arduino
nano328_340.build.variant=eightanaloginputs

##############################################################

nano328_340_old.name=Arduino Nano w/ ATmega328/CH340G (Old bootloader)

nano328_340_old.upload.protocol=arduino
nano328_340_old.upload.maximum_size=30720
nano328_340_old.upload.speed=57600
nano328_340_old.upload.uart_mode=3

nano328_340_old.bootloader.low_fuses=0xFF
nano328_340_old.bootloader.high_fuses=0xDA
nano328_340_old.bootloader.extended_fuses=0x05
nano328_340_old.bootloader.path=atmega
nano328_340_old.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328_340_old.bootloader.unlock_bits=0x3F
nano328_340_old.bootloader.lock_bits=0x0F

nano328_340_old.build.mcu=atmega328p
nano328_340_old.build.f_cpu=16000000L
nano328_340_old.build.board=AVR_NANO
nano328_340_old.build.core=arduino
nano328_340_old.build.variant=eightanaloginputs

##############################################################

nano.name=Arduino Nano w/ ATmega168

nano.upload.protocol=arduino
nano.upload.maximum_size=14336
nano.upload.speed=19200
nano.upload.uart_mode=1

nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xdd
nano.bootloader.extended_fuses=0x00
nano.bootloader.path=atmega
nano.bootloader.file=ATmegaBOOT_168_diecimila.hex
nano.bootloader.unlock_bits=0x3F
nano.bootloader.lock_bits=0x0F

nano.build.mcu=atmega168
nano.build.f_cpu=16000000L
nano.build.board=AVR_NANO
nano.build.core=arduino
nano.build.variant=eightanaloginputs

##############################################################

mega2560.name=Arduino Mega 2560 or Mega ADK

mega2560.upload.protocol=wiring
mega2560.upload.maximum_size=258048
mega2560.upload.speed=115200

mega2560.bootloader.low_fuses=0xFF
mega2560.bootloader.high_fuses=0xD8
mega2560.bootloader.extended_fuses=0xFD
mega2560.bootloader.path=stk500v2
mega2560.bootloader.file=stk500boot_v2_mega2560.hex
mega2560.bootloader.unlock_bits=0x3F
mega2560.bootloader.lock_bits=0x0F

mega2560.build.mcu=atmega2560
mega2560.build.f_cpu=16000000L
mega2560.build.board=AVR_MEGA2560
mega2560.build.core=arduino
mega2560.build.variant=mega

##############################################################

mega2560_340.name=Arduino Mega 2560 CH340G
mega2560_340.upload.protocol=wiring
mega2560_340.upload.maximum_size=258048
mega2560_340.upload.speed=115200
mega2560_340.upload.uart_mode=1

mega2560_340.bootloader.low_fuses=0xFF
mega2560_340.bootloader.high_fuses=0xD8
mega2560_340.bootloader.extended_fuses=0xFD
mega2560_340.bootloader.path=stk500v2
mega2560_340.bootloader.file=stk500boot_v2_mega2560.hex
mega2560_340.bootloader.unlock_bits=0x3F
mega2560_340.bootloader.lock_bits=0x0F

mega2560_340.build.mcu=atmega2560
mega2560_340.build.f_cpu=16000000L
mega2560_340.build.board=AVR_MEGA2560
mega2560_340.build.core=arduino
mega2560_340.build.variant=mega

##############################################################

mega.name=Arduino Mega (ATmega1280)

mega.upload.protocol=arduino
mega.upload.maximum_size=126976
mega.upload.speed=57600
mega.upload.uart_mode=1

mega.bootloader.low_fuses=0xFF
mega.bootloader.high_fuses=0xDA
mega.bootloader.extended_fuses=0xF5
mega.bootloader.path=atmega
mega.bootloader.file=ATmegaBOOT_168_atmega1280.hex
mega.bootloader.unlock_bits=0x3F
mega.bootloader.lock_bits=0x0F

mega.build.mcu=atmega1280
mega.build.f_cpu=16000000L
mega.build.board=AVR_MEGA
mega.build.core=arduino
mega.build.variant=mega

##############################################################

leonardo.name=Arduino Leonardo
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true

leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb
leonardo.bootloader.path=caterina
leonardo.bootloader.file=Caterina-Leonardo.hex
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.board=AVR_LEONARDO
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.core=arduino
leonardo.build.variant=leonardo

##############################################################

esplora.name=Arduino Esplora
esplora.upload.protocol=avr109
esplora.upload.maximum_size=28672
esplora.upload.speed=57600
esplora.upload.disable_flushing=true

esplora.bootloader.low_fuses=0xff
esplora.bootloader.high_fuses=0xd8
esplora.bootloader.extended_fuses=0xcb
esplora.bootloader.path=caterina
esplora.bootloader.file=Caterina-Esplora.hex
esplora.bootloader.unlock_bits=0x3F
esplora.bootloader.lock_bits=0x2F

esplora.build.mcu=atmega32u4
esplora.build.f_cpu=16000000L
esplora.build.board=AVR_ESPLORA
esplora.build.vid=0x2341
esplora.build.pid=0x803C
esplora.build.core=arduino
esplora.build.variant=leonardo

